rtzaudio/STC1200_TivaTM4C1294NCPDT/CLITask.c
    *--out = 0;
}

/* List files in a directory with time, date, size and file name */

FRESULT _dirlist(char* path)
{
    FRESULT res;
    DIR dir;
    uint32_t numdirs = 0L;
    uint32_t numfiles = 0L;
    uint32_t bytes = 0L;
    FATFS *fs;
    DWORD fre_clust;
    DWORD fre_sect;
    DWORD tot_sect;
    char buf[_MAX_LFN];
    char tmp[32];
    static FILINFO fno;

    /* Open the directory */
    if ((res = f_opendir(&dir, path)) != FR_OK)
    {
        CLI_printf("%s\n", FS_GetErrorStr(res));
    }
    else
    {
        for (;;)
        {
            /* Read a directory item */
            res = f_readdir(&dir, &fno);

            /* Break on error or end of dir */
            if (res != FR_OK || fno.fname[0] == 0)
                break;

            if (fno.fattrib & AM_SYS)
                continue;

            bytes += (uint64_t)fno.fsize;

            /* Print the file date */
            FS_GetDateStr(fno.fdate, buf, sizeof(buf));
            CLI_puts(buf);
            CLI_emit(' ', 2);

            FS_GetTimeStr(fno.ftime, buf, sizeof(buf));
            CLI_puts(buf);

            if (fno.fattrib & AM_DIR)
            {
                sprintf(buf, "%-15s", "<DIR>");
                ++numdirs;
            }
            else
            {
                _fmt_commas(fno.fsize, tmp);
                sprintf(buf, "%15s", tmp);
                ++numfiles;
            }

            if (fno.lfname)
                CLI_printf("    %s %s\n", buf, fno.lfname);
            else
                CLI_printf("    %s %s\n", buf, fno.fname);
        }

        f_closedir(&dir);

        sprintf(buf, "\n\t%8d File(s)", numfiles);
        CLI_puts(buf);

        _fmt_commas(bytes, tmp);
        sprintf(buf, "  %s bytes\n", tmp);
        CLI_puts(buf);

        sprintf(buf, "\t%8d Dir(s)", numdirs);
        CLI_puts(buf);

        /* Get volume information and free clusters of drive 1 */
        if ((res = f_getfree("0:", &fre_clust, &fs)) == FR_OK)
        {
            /* Get total sectors and free sectors */
            tot_sect = (fs->n_fatent - 2) * fs->csize;
            fre_sect = fre_clust * fs->csize;

            _fmt_commas(fre_sect/2, tmp);
            sprintf(buf, "  %s bytes free\n", tmp);
            CLI_puts(buf);

            /* Print the free space (assuming 512 bytes/sector) */
            //CLI_printf("%10lu KiB total drive space\n", tot_sect/2);
        }
        else
        {
            CLI_putc('\n');
        }
    }

    (void)tot_sect;

    return res;
}

/* Update and return the current working directory */

char* _getcwd(void)
{
    FRESULT res;

    res = f_getcwd(s_cwd, sizeof(s_cwd)-1);

    if (res != FR_OK)
    {
        s_cwd[0] = 0;
    }

    return s_cwd;
}

/* Print file system error message */

void _perror(FRESULT res)
{
    CLI_printf("%s\n", FS_GetErrorStr(res));
}

/* Acknowledge successful command with new line, or error message */

FRESULT _checkcmd(FRESULT res)
{
    if (res == FR_OK)
        CLI_putc('\n');
    else
        _perror(res);

    return res;
}

//*****************************************************************************
// BASIC CLI COMMANDS
//*****************************************************************************

void cmd_help(int argc, char *argv[])
{
    char name[16];
    int x, len;
    int i = NUM_CMDS;

    CLI_puts("\nAvailable Commands:\n\n");

    //while(i--)

    for(i=0; i < NUM_CMDS; i++)
    {
        cmd_t cmd = dispatch[i];

        len = strlen(cmd.name);

        for (x=0; x < len; x++)
        {
            name[x] = toupper(cmd.name[x]);
            name[x+1] = 0;

            if (x >= sizeof(name)-1)
                break;
        }

        CLI_printf(" %-10s%s\n", name, cmd.doc);
    }
}

void cmd_about(int argc, char *argv[])
{
    CLI_about();
}

void cmd_cls(int argc, char *argv[])
{
    CLI_home();
}

//*****************************************************************************
// GENERAL SYSTEM COMMANDS
//*****************************************************************************

void cmd_sn(int argc, char *argv[])
{
    char serialnum[64];
    GetSerialNumStr(serialnum, g_sys.ui8SerialNumberSTC);
    CLI_printf("%s\n", serialnum);
}

void cmd_ip(int argc, char *argv[])
{
    CLI_printf("%s\n", g_sys.ipAddr);
}

void cmd_mac(int argc, char *argv[])
{
    char mac[32];
    GetMACAddrStr(mac, g_sys.ui8MAC);
    CLI_printf("%s\n", mac);
}

void cmd_stat(int argc, char *argv[])
{
    /* Show basic system status */
    CLI_printf("\nSYSTEM STATUS\n\n");
    CLI_printf("Tape roller tach   : %u\n", (uint32_t)g_sys.tapeTach);
    CLI_printf("Tape roller errors : %u\n", g_sys.qei_error_cnt);
    CLI_printf("Encoder position   : %d\n", g_sys.tapePosition);
    CLI_printf("Tape Speed         : %d IPS\n", g_sys.tapeSpeed);
    CLI_printf("RTC clock type     : %s\n", (g_sys.rtcFound) ? "RTC" : "CPU");
    CLI_printf("IPC rx errors      : %d\n", g_ipc.rxErrors);
    CLI_printf("Standby Mon Active : %c\n", (g_sys.standbyActive) ? '1' : '0');

    /* Show if DCS controller found or not */
    CLI_printf("DCS controller     : ");
    if (g_sys.dcsFound)
        CLI_printf("%d track\n", g_sys.trackCount);
    else
        CLI_printf("(n/a)\n");

    /* Show if SMPT controller found or not */
    CLI_printf("SMPTE controller   : ");
    if (g_sys.smpteFound)
        CLI_printf("found\n");
    else
        CLI_printf("(n/a)\n");

    CLI_printf("Net TCP address    : ");    cmd_ip(argc, argv);
    CLI_printf("Net MAC address    : ");    cmd_mac(argc, argv);

#if 0
    /* Show IPC Server Status */
    CLI_printf("\nIPC Status\n\n");
    CLI_printf("Rx Errors          : %d\n", g_ipc.rxErrors);
    CLI_printf("Rx Count           : %d\n", g_ipc.rxCount);
    CLI_printf("Rx Num Free        : %d\n", g_ipc.rxNumFreeMsgs);
    CLI_printf("Rx Last Seq        : %d\n", g_ipc.rxLastSeq);
    CLI_printf("Rx ExpectedSeq     : %d\n", g_ipc.rxExpectedSeq);
    CLI_printf("Tx Count           : %d\n", g_ipc.txCount);
    CLI_printf("Tx Num Free        : %d\n", g_ipc.txNumFreeMsgs);
    CLI_printf("Tx Next Seq        : %d\n", g_ipc.txNextSeq);
#endif
}

void cmd_cfg(int argc, char *argv[])
{
    if (argc == 1)
    {
        if (strcmp(argv[0], "save") == 0)
        {
            ConfigSave(1);
            CLI_puts("Configuration Saved\n");
        }
        else if (strcmp(argv[0], "load") == 0)
        {
            ConfigLoad(1);
            CLI_puts("Configuration Loaded\n");
        }
        else if (strcmp(argv[0], "reset") == 0)
        {
            ConfigReset(1);
            CLI_puts("Configuration Reset\n");
        }
        else
        {
            CLI_puts("Invalid Option\n");
        }
    }
    else
    {
        CLI_puts("Usage: cfg {save|reset|load}\n");
    }
}

//*****************************************************************************
// TAPE TRANSPORT COMMANDS
//*****************************************************************************

void cmd_stop(int argc, char *argv[])
{
    CLI_puts("STOP\n");
    Transport_PostButtonPress(S_STOP);
}

void cmd_play(int argc, char *argv[])
{
    uint32_t mask = S_PLAY;

    if (argc)
    {
        if (strcmp(argv[0], "rec") == 0)
            mask |= S_REC;
    }

