rtzaudio/STC1200_TivaTM4C1294NCPDT/CLITask.c
    _dirlist(buf);
}

void cmd_cwd(int argc, char *argv[])
{
    CLI_printf("%s\n", _getcwd());
}

void cmd_cd(int argc, char *argv[])
{
    FRESULT res;

    if (argc == 1)
    {
        /* Attempt to change to the directory path */
        res = f_chdir(argv[0]);

        /* Read back the current directory we're in */
        _getcwd();

        _checkcmd(res);
    }
    else
    {
        _getcwd();

        CLI_printf("%s\n", s_cwd);
    }
}

void cmd_md(int argc, char *argv[])
{
    FRESULT res;

    if (argc == 1)
    {
        /* Attempt to make a directory */
        res = f_mkdir(argv[0]);

        _checkcmd(res);
    }
}

void cmd_ren(int argc, char *argv[])
{
    FRESULT res;

    if (argc == 2)
    {
        /* Rename/Move a file or directory */
        res = f_rename(argv[0], argv[1]);

        _checkcmd(res);
    }
}

void cmd_del(int argc, char *argv[])
{
    FRESULT res;

    if (argc == 1)
    {
        /* Attempt to make a directory */
        res = f_unlink(argv[0]);

        _checkcmd(res);
    }
}

void cmd_copy(int argc, char *argv[])
{
    FIL fsrc, fdst;
    FRESULT res;
    UINT br, bw;
    BYTE buf[256];
    char src[128];
    char dest[128];

    if (argc != 2)
    {
        CLI_printf("Source and destination name are required\n");
        return;
    }

    strcpy(src, "0:");
    strncpy(&src[2], argv[0], sizeof(src)-4);

    /* Open source file on the drive 1 */
    res = f_open(&fsrc, src, FA_READ);

    if (res != FR_OK)
    {
        _checkcmd(res);
        return;
    }

    strcpy(dest, "0:");
    strncpy(&dest[2], argv[1], sizeof(dest)-4);

    /* Create destination file on the drive 0 */
    res = f_open(&fdst, dest, FA_WRITE | FA_CREATE_ALWAYS);

    if (res != FR_OK)
    {
        f_close(&fsrc);
        _checkcmd(res);
        return;
    }

    CLI_puts("Copying...");

    /* Copy source to destination */
    for (;;)
    {
        /* Read a chunk of data from the source file */
        res = f_read(&fsrc, buf, sizeof(buf), &br);

        if (br == 0)
            break;      /* error or eof */

        /* Write it to the destination file */
        res = f_write(&fdst, buf, br, &bw);

        if (bw < br)
        {
            /* error or disk full */
            _checkcmd(res);
            break;
        }
    }

    CLI_puts("done\n");

    f_close(&fsrc);
    f_close(&fdst);
}

//*****************************************************************************
// FILE TRANSFER COMMANDS
//*****************************************************************************

void cmd_xmdm(int argc, char *argv[])
{
    int rc = 0;
    char errmsg[24];
    FIL fp;
    FRESULT res = FR_OK;

    char *eraseEOL = VT100_ERASE_EOL;

    CLI_putc('\n');

    if (argc != 2)
    {
        CLI_printf("XMODEM Usage:\n\n");
        CLI_printf("xmdm s {filename}\t[sends a file]\n");
        CLI_printf("xmdm r {filename}\t[receives a file]\n");
        return;
    }

    if (toupper(*argv[0]) == 'R')
    {
        /* Receive a file */
        if ((res = f_open(&fp, argv[1], FA_WRITE|FA_OPEN_ALWAYS)) == FR_OK)
        {
            CLI_printf("XMODEM Receive Ready\n");

            /* Receive file via XMODEM */
            rc = xmodem_receive(s_handleUart, &fp);

            f_close(&fp);

            if (rc != XMODEM_SUCCESS)
            {
                /* Delete the file, it's not valid */
                f_unlink(argv[1]);

                xmodem_get_error(rc, errmsg, sizeof(errmsg));

                CLI_printf("\r%s\rReceive Error %d: %s\n", eraseEOL, rc, errmsg);
            }
            else
            {
                CLI_printf("\r%s\rReceive Complete\n", eraseEOL);
            }
        }
        else
        {
            _perror(res);
        }
    }
    else if (toupper(*argv[0]) == 'S')
    {
        /* Send a file */
        if ((res = f_open(&fp, argv[1], FA_READ)) == FR_OK)
        {
            CLI_printf("XMODEM Send Ready\n");

            /* Send file via XMODEM */
            rc = xmodem_send(s_handleUart, &fp);

            f_close(&fp);

            if (rc != XMODEM_SUCCESS)
            {
                xmodem_get_error(rc, errmsg, sizeof(errmsg));

                CLI_printf("\r%s\rSend Error %d: %s\n", eraseEOL, rc, errmsg);
            }
            else
            {
                CLI_printf("\r%s\rSend Complete\n", eraseEOL);
            }
        }
        else
        {
            _perror(res);
        }
    }
    else
    {
        CLI_printf("Invalid Option\n");
    }
}

void xmodem_get_error(int err, char* buf, int bufsize)
{
    switch(err)
    {
    case XMODEM_SUCCESS:
        snprintf(buf, bufsize, "success");
        break;

    case XMODEM_NO_RESPONSE:
        snprintf(buf, bufsize, "no response");
        break;

    case XMODEM_TIMEOUT:
        snprintf(buf, bufsize, "timeout");
        break;

    case XMODEM_CANCEL:
        snprintf(buf, bufsize, "cancel");
        break;

    case XMODEM_MAX_RETRIES:
        snprintf(buf, bufsize, "max retries");
        break;

    case XMODEM_FILE_WRITE:
        snprintf(buf, bufsize, "file write error");
        break;

    case XMODEM_FILE_READ:
        snprintf(buf, bufsize, "file read error");
        break;

    default:
        snprintf(buf, bufsize, "error=%d", err);
        break;
    }
}

// End-Of-File
